<?php 

	/*
		打印1~100之间7的倍数
		打印1~100之间个位为7的数
		打印1~100之间十位为7的数
		打印1~100之间个位不为7，十位不为7，以及不是7的倍数
		打印九九乘法表
	*/

	// 1.打印1~100之间7的倍数
	/*for ($i=1; $i <= 100; $i++) { 
		
		if ($i % 7 == 0) {
			echo $i;
			echo "<br>";
		}
	}*/



	// 2.打印1~100之间个位为7的数
	/*for ($i=1; $i <= 100; $i++) { 
		
		if ($i % 10 == 7) {
			echo $i;
			echo "<br>";
		}
	}*/

	// 3.打印1~100之间十位为7的数
	/*for ($i=1; $i <= 100; $i++) { 
		
		if (($i - $i % 10) / 10== 7) {
			echo $i;
			echo "<br>";
		}
	}*/

	// 4.打印1~100之间个位不为7，十位不为7，以及不是7的倍数
	/*for ($i=1; $i <= 100; $i++) { 
		
		if (($i % 10 != 7) && (($i - $i % 10) / 10 != 7) && ($i % 7 != 0)) {
			echo $i;
			echo "<br>";
		}
	}*/

	// 5.打印九九乘法表
	/*for ($i=1; $i <= 9; $i++) { 
		
		for ($j=1; $j <= $i; $j++) { 
			
			echo $i." * ".$j." = ".$i * $j;

			if ($i*$j<10) {
				echo "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;";
			}else{
				echo "&nbsp;&nbsp;&nbsp;";
			}
		}
		echo "<br>";		
	}*/

	echo"<table border='2' width='400'>";  
	for($i=1;$i<=9;$i++)  
	{  
    	echo"<tr>";  
    	for($j=1;$j<=$i;$j++)  
    	{  
      	echo "<td>{$i}*{$j}=".($i*$j)."</td> ";  
    	}  
    	echo"</tr>";  
	}  
	echo"</table>";  

 ?>